package main

import (
	"fmt"
	calc "lab4/calculator" // імпорт локального службового пакету, calc - це псевдонім імпортованого пакету.
)

func main() {
	fmt.Println("==================================================")
	fmt.Println("   ЛАБОРАТОРНА РОБОТА №4 | ВАРІАНТ 11            ")
	fmt.Println("==================================================")

	a, b := 15, 4

	fmt.Printf("Вхідні дані: a = %d, b = %d\n", a, b)
	fmt.Println("--------------------------------------------------")

	// Використання функцій імпортованого службового пакету calculator
	fmt.Printf("Add(%d, %d) = %d\n", a, b, calc.Add(a, b))
	fmt.Printf("Sub(%d, %d) = %d\n", a, b, calc.Sub(a, b))
	fmt.Printf("Mul(%d, %d) = %d\n", a, b, calc.Mul(a, b))

	fmt.Println("==================================================")
	fmt.Println("              ВИКОНАННЯ ЗАВЕРШЕНО                 ")
	fmt.Println("==================================================")
}